import Footer from "../Footer/footer";
import Intro from "../mainPage/intro";
import Text from "../mainPage/text";
function AboutUs() {
  return (
    <div>
      <Intro
        kind={<img src="/aboutUs.jpg" alt="main_abouUs" />}
        text="Про нас"
        textspan=""
      />
      <Text
        headline="Про розробника та  ідею проекту"
        text="Ласкаво просимо до нашого веб-сервісу!
я студентка Національного технічного університету 'Харківський політехнічний інститут'. у мене Виникла ідея створити цей веб-сервіс на основі моєї власної досвіду навчання. Як студентці мені було складно знаходити якісні ресурси для вивчення Python, особливо тому, що російськомовна інформація мені була важко сприймати.
Саме тому я вирішила створити цей курс. На цьому веб-ресурсі студенти та школярі можуть вивчити Python безкоштовно та з задоволенням. Одне з головних переваг - це зручна навігація та зрозуміло пояснений матеріал. Я розумію, наскільки важливо мати доступ до навчальних ресурсів, які відповідають потребам , тому я намагалася зробити цей курс максимально корисним і зрозумілим для кожного.
Крім того , я отримувала значну підтримку та слова мотивації від доцентки кафедри Комп'ютерного моделювання процесів та систем університету НТУ ХПІ, що значно полегшило процес створення курсу, за що я хочу подякувати."
      />
      <img src="/flowers.jpg" alt="aboutUs" />
      <Text
        headline="Для кого цей курс Python basic"
        text='Курс "Python Basic" був розроблений для абсолютних новачків у програмуванні та для тих, хто має бажання освоїти та оволодіти мовою програмування Python. Ця мова є однією з найпопулярніших мов програмування у світі . Вона відома своєю простотою, читабельністю коду та активною спільнотовою підтримкою.

Особливо важливо зазначити, що цей курс абсолютно безкоштовний та був створений за підтримки національного технічного університету Харківського політехнічного інституту у вигляді дипломної роботи.'
      />
      <Footer />
    </div>
  );
}
export default AboutUs;
