import MenuLessonsStart from "./lessons";
import { Link } from "react-router-dom";
export const MainCoursePage = () => {
  return (
    <div className="grid grid-cols-8">
      <div className="col-span-2">
        <MenuLessonsStart />
      </div>
      <div className="col-span-6 pb-4 pt-8 mt-20 lg:pl-24 lg:pr-16 md:pl-24 md:pr-16 sm:pl-20 sm:pr-4 pl-20 pr-4 overflow-y-auto overflow-x-hidden max-h-[580px]">
        <p className="mt-6 text-xl  mb-4">
          <span className="text-[red] font-semibold">Python</span> - одна з тих
          рідкісних мов, які можуть претендувати на те, щоб бути одночасно
          простими і потужними. Ви будете приємно здивовані, побачивши,
          наскільки легко зосередитися на вирішенні проблеми, а не на синтаксисі
          та структурі мови, якою ви програмуєте.
        </p>
        <p className="mt-6 text-xl font-semibold mb-4">
          Офіційний вступ до Python:
        </p>

        <div className="bg-gray-100 mb-4 mt-6 p-4 border-red-500 border-l-4">
          Python - це проста у вивченні, потужна мова програмування. Вона має
          ефективні високорівневі структури даних та простий, але ефективний
          підхід до об'єктно-орієнтованого програмування. Елегантний синтаксис і
          динамічна типізація Python, разом з його інтерпретованою природою,
          роблять його ідеальною мовою для написання сценаріїв і швидкої
          розробки додатків у багатьох сферах на більшості платформ.
        </div>

        <p className="mt-6 text-2xl font-semibold mb-4">Історія назви</p>
        <p>
          Гвідо ван Россум, творець мови Python, назвав її на честь шоу BBC
          "Летючий цирк Монті Пайтона". Він не дуже любить змій, які вбивають
          тварин заради їжі, обвиваючи їх своїми довгими тілами і розчавлюючи.
        </p>
        <p className="mt-6 text-2xl font-semibold mb-4">
          Особливості мови Python
        </p>
        <p className="mt-6 text-xl font-semibold mb-4">Простота</p>
        <p>
          Python - це проста і мінімалістична мова. Читання хорошої програми на
          Python схоже на читання англійської, хоча і дуже суворої англійської!
          Ця псевдокодова природа Python є однією з його найбільших переваг.
          Вона дозволяє зосередитися на вирішенні проблеми, а не на самій мові.
        </p>
        <p className="mt-6 text-xl font-semibold mb-4">Легко вивчати</p>
        <p>
          Як ви побачите, з Python надзвичайно легко почати працювати. Як уже
          згадувалося, Python має надзвичайно простий синтаксис.
        </p>
        <p className="mt-6 text-xl font-semibold mb-4">
          Безкоштовний та відкритий код
        </p>
        <p>
          Python є прикладом FLOSS (Free/Libre and Open Source Software).
          Простіше кажучи, ви можете вільно розповсюджувати копії цього
          програмного забезпечення, читати його вихідний код, вносити в нього
          зміни і використовувати його частини в нових вільних програмах. FLOSS
          базується на концепції спільноти, яка ділиться знаннями. Це одна з
          причин, чому Python такий хороший - він був створений і постійно
          вдосконалюється спільнотою, яка просто хоче бачити кращий Python.
        </p>
        <p className="mt-6 text-xl font-semibold mb-4">Мова високого рівня</p>
        <p>
          Коли ви пишете програми на Python, вам ніколи не потрібно турбуватися
          про низькорівневі деталі, такі як керування пам'яттю, що
          використовується вашою програмою, тощо.
        </p>
        <p className="mt-6 text-xl font-semibold mb-4">Об'єктно-орієнтована</p>
        <p>
          Python підтримує як процедурно-орієнтоване програмування, так і
          об'єктно-орієнтоване програмування (ООП). В процедурно-орієнтованих
          мовах програма будується навколо процедур або функцій, які є нічим
          іншим, як частинами програми, що можуть бути використані повторно. В
          об'єктно-орієнтованих мовах програма будується навколо об'єктів, які
          поєднують дані та функціональність. Python має дуже потужний, але
          простий спосіб застосування ООП, особливо у порівнянні з великими
          мовами, такими як C++ або Java.
        </p>
        <p className="mt-6 text-xl font-semibold mb-4">Розширюваність</p>
        <p>
          Якщо вам потрібно, щоб критичний фрагмент коду працював дуже швидко,
          або ви хочете, щоб певна частина алгоритму не була відкритою, ви
          можете написати цю частину вашої програми на C або C++, а потім
          використовувати її з вашої програми на Python.
        </p>
        <p className="mt-6 text-xl font-semibold mb-4">Вбудовування</p>
        <p>
          Ви можете вбудовувати Python у ваші C/C++ програми, щоб надати
          користувачам вашої програми можливості написання сценаріїв.
        </p>
        <p className="mt-6 text-xl font-semibold mb-4">Великі бібліотеки</p>
        <p>
          Стандартна бібліотека Python дійсно величезна. Вона може допомогти вам
          робити різні речі, пов'язані з регулярними виразами, генерацією
          документації, модульним тестуванням, багатопотоковістю, базами даних,
          веб-браузерами, CGI, FTP, електронною поштою, XML, XML-RPC, HTML, WAV
          файлами, криптографією, GUI (графічним інтерфейсом користувача) та
          іншими системно-залежними речами. Пам'ятайте, що все це завжди
          доступно, де б не був встановлений Python. Це називається філософією
          Python "Batteries Included".
        </p>
        <p>
          Окрім стандартної бібліотеки, існує безліч інших високоякісних
          бібліотек, які ви можете знайти в індексі пакунків Python.
        </p>
        <p className="mt-6 text-xl font-semibold mb-4">Підсумок</p>
        <div className="bg-gray-100 mb-8 mt-6 p-4 border-red-500 border-l-4">
          Python - це справді цікава та потужна мова. Вона має правильне
          поєднання продуктивності та можливостей, які роблять написання програм
          на Python цікавим та легким.
        </div>
        <Link
          to="/lessons/65fd593e2e470062dece1e50"
          className="lg:p-4 md:p-4 sm:p-2 p-2 lg:mr-4  bg-red-500 lg:text-xl md:text-xl sm:text-sm text-sm text-white font-semibold rounded-md"
        >
          Перейти до навчання
        </Link>
      </div>
    </div>
  );
};

export default MainCoursePage;
